chanvenjoe/STM32-learning/N76E003_BSP_Keil_C51_V1.0.6/942 PID/Code/ADC.C
#include "N76E003.h"
#include "SFR_Macro.h"
#include "Function_define.h"
#include "Common.h"
#include "Delay.h"
#include "Motor_control.h"

//*****************  The Following is in define in Fucntion_define.h  ***************************
//****** Always include Function_define.h call the define you want, detail see main(void) *******
//***********************************************************************************************
#define CCvalue 0x14; //change the current regulation value

#define Not_Pressed PWM5_P03_OUTPUT_DISABLE; PWM4_P01_OUTPUT_DISABLE; clr_P01; set_P03;
#define Pressed PWM5_P03_OUTPUT_ENABLE; PWM4_P01_OUTPUT_ENABLE;
bit pwr_d=0;

#if 0
//#define Enable_ADC_AIN0			ADCCON0&=0xF0;P17_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT0;ADCCON1|=SET_BIT0									//P17
//#define Enable_ADC_AIN1			ADCCON0&=0xF0;ADCCON0|=0x01;P30_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT1;ADCCON1|=SET_BIT0		//P30
//#define Enable_ADC_AIN2			ADCCON0&=0xF0;ADCCON0|=0x02;P07_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT2;ADCCON1|=SET_BIT0		//P07
//#define Enable_ADC_AIN3			ADCCON0&=0xF0;ADCCON0|=0x03;P06_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT3;ADCCON1|=SET_BIT0		//P06
//#define Enable_ADC_AIN4			ADCCON0&=0xF0;ADCCON0|=0x04;P05_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT4;ADCCON1|=SET_BIT0		//P05
//#define Enable_ADC_AIN5			ADCCON0&=0xF0;ADCCON0|=0x05;P04_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT5;ADCCON1|=SET_BIT0		//P04
//#define Enable_ADC_AIN6			ADCCON0&=0xF0;ADCCON0|=0x06;P03_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT6;ADCCON1|=SET_BIT0		//P03
//#define Enable_ADC_AIN7			ADCCON0&=0xF0;ADCCON0|=0x07;P11_Input_Mode;AINDIDS=0x00;AINDIDS|=SET_BIT7;ADCCON1|=SET_BIT0		//P11
//#define Enable_ADC_BandGap	ADCCON0|=SET_BIT3;ADCCON0&=0xF8;																															//Band-gap 1.22V

//#define PWM0_FALLINGEDGE_TRIG_ADC		ADCCON0&=~SET_BIT5;ADCCON0&=~SET_BIT4;ADCCON1&=~SET_BIT3;ADCCON1&=~SET_BIT2;ADCCON1|=SET_BIT1
//#define PWM2_FALLINGEDGE_TRIG_ADC		ADCCON0&=~SET_BIT5;ADCCON0|=SET_BIT4;ADCCON1&=~SET_BIT3;ADCCON1&=~SET_BIT2;ADCCON1|=SET_BIT1
//#define PWM4_FALLINGEDGE_TRIG_ADC		ADCCON0|=SET_BIT5;ADCCON0&=~SET_BIT4;ADCCON1&=~SET_BIT3;ADCCON1&=~SET_BIT2;ADCCON1|=SET_BIT1
//#define PWM0_RISINGEDGE_TRIG_ADC		ADCCON0&=~SET_BIT5;ADCCON0&=~SET_BIT4;ADCCON1&=~SET_BIT3;ADCCON1|=SET_BIT2;ADCCON1|=SET_BIT1
//#define PWM2_RISINGEDGE_TRIG_ADC		ADCCON0&=~SET_BIT5;ADCCON0|=SET_BIT4;ADCCON1&=~SET_BIT3;ADCCON1|=SET_BIT2;ADCCON1|=SET_BIT1
//#define PWM4_RISINGEDGE_TRIG_ADC		ADCCON0|=SET_BIT5;ADCCON0&=~SET_BIT4;ADCCON1&=~SET_BIT3;ADCCON1|=SET_BIT2;ADCCON1|=SET_BIT1

//#define P04_FALLINGEDGE_TRIG_ADC		ADCCON0|=0x30;ADCCON1&=0xF3;ADCCON1|=SET_BIT1;ADCCON1&=~SET_BIT6
//#define P13_FALLINGEDGE_TRIG_ADC		ADCCON0|=0x30;ADCCON1&=0xF3;ADCCON1|=SET_BIT1;ADCCON1|=SET_BIT6
//#define P04_RISINGEDGE_TRIG_ADC			ADCCON0|=0x30;ADCCON1&=~SET_BIT3;ADCCON1|=SET_BIT2;ADCCON1|=SET_BIT1;ADCCON1&=~SET_BIT6
//#define P13_RISINGEDGE_TRIG_ADC			ADCCON0|=0x30;ADCCON1&=~SET_BIT3;ADCCON1|=SET_BIT2;ADCCON1|=SET_BIT1;ADCCON1|=SET_BIT6
#endif

/******************************************************************************
The main C function.  Program execution starts
here after stack initialization.
******************************************************************************/

void WTD_Init()
{
	TA=0xAA;TA=0x55;WDCON=0x07;  		//Setting WDT prescale 
	set_WDTR;                       //WDT run
	set_WDCLR;											//Clear WDT timer
	set_EWDT;// WTD inter_rupt enable
	EA =1; //Global inter_rupt enable
	
	TMOD = 0xff;
	TIMER0_MODE1_ENABLE;//MODE1 16BITS timer/Counter
	TIMER1_MODE1_ENABLE;
	clr_T0M;// Timer 1 clock from sys_clk/12

	
	set_ET0;
//	set_TR0;
	
}

void Pin_Interruput_Init()
{
	set_EA;
	PICON = 0x21;// Port1 Pin3 edge trigger
	PINEN = 0x08; //PIN3 falling/low trigger PIPEN: Rising/high trigger
	PIPEN = 0X00;
	EIE   = 0x02; // PIN interrupt enable
	set_P0S_3;
//	EIP = 0x02; //PRIORITY SETTING
//	EIPH	 = 0x02;
}

void PD_Timer0() interrupt 1
{
	if(TF0)
	{
		if(P12==1)
		{
			Not_Pressed
			pwr_d = 1;
		}
	}
}

void Pin_Interruput() interrupt 7
{
	
	if(PIF==0x08)
	{
		PIF = 0x00; // clr interrupt flag
		Timer0_Delay1ms(1);
		if(P13==0)
		{
			P12=~P12;//LED on/off
			TH0 = 0xff; // timer filter
//			TL0 = 0xFF;
			set_TR0;
		}
	}
}

void main (void)
{
	Set_All_GPIO_Quasi_Mode;			//For GPIO1 output, Find in "Function_define.h" - "GPIO INIT"
	InitialUART0_Timer1(115200);
	ADC_Init();							
	WTD_Init();
	Pin_Interruput_Init();
										//reverved for timer_init   Sleep2
	PWM_Init();
	while(1)
	{
		UINT8 i = Get_HallValue();// can use public structure or ...		The variables should be define at the first line
		UINT8 j = Get_CurrentValue();
		UINT8 k = Get_Speedvalue();
		UINT8 pwm_step = (i-51)>=0? (i-51)*2/3:0;  //return  %
		set_WDCLR;
		if(i>52)// to prevent hall initial voltage is 1.0v
		{
			Pressed
			switch(j>57)//20A=57
			{
				case 0:
				{
					PWM_Setting(pwm_step,k);// PWM first, or the moment relay on, PWM still 0 cause big inrush
				}
				break;
				case 1:
				{
					if(PWM4L>125)// PWM>50%
					{
						j=j*0.35;// Current calculation from current shunt-> OA-> ADC j=actural current
						PWM4L=(PWM4L+Incremental_P(j, 20)*3/2)>50? (PWM4L+Incremental_P(j, 20)*3/2):50;;//PWM delta value, if the 
												//reserve for timer counting
						set_LOAD;set_PWMRUN;
	//					Relay_On(k);		//Forward Relay open
						j=0;
					}
				}
				break;
				default:
					break;
			}
		}
		else//the brake should only works when pedal released
		{
			if(P00==1||P10==1)
			{
				PWM4L=0;
				set_LOAD;set_PWMRUN;
				Timer0_Delay1ms(400);		
				PWM4L=7;
				set_LOAD;set_PWMRUN;
				Timer0_Delay1ms(400);
				Relay_Off();
				Not_Pressed
			}
			else
			{
				PWM4L=0;
				set_LOAD;set_PWMRUN;
				Relay_Off();
			}
		}
		if(pwr_d==1)
		{
			pwr_d = 0;
			set_PD;
		}
	}
}


